---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailStructure
source: html/0ee86900-4143-cf08-31ab-3e147e54d997.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingRailStructure Property

"Rail Structure (Non-Continuous)"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingRailStructure { get; }
```